Backend/app/Http/Controllers/AuthController.php

    public function register( StoreUserRequest $request){

        $user = User::create([
            "first_name" => $request->first_name,
            "last_name" => $request->last_name,
            "role" => $request->role,
            "phone" => $request->phone,
            "address" => $request->address,
            "zip" => $request->zip,
            "city" => $request->city,
            "email" => $request->email,
            "password" => Hash::make($request->password),
        ]);
---
insert into `users` (`first_name`, `last_name`, `phone`, `address`, `zip`, `city`, `email`, `password`, `updated_at`, `created_at`) values ('Elek', 'Teszt', '+36305550000', 'Teszt elek 15', '1111', 'Budapest', 'tesztelek@tesztelek.hu', '$2y$10$EOyxhEs927/60LHdjOktOua2zmpM8tzsDeuMauqJNpzWjID9wTub6', '2024-04-06 09:37:31', '2024-04-06 09:37:31')

    public function login(Request $request)
    {
        $user = User::where("email", $request->email)->first();
---
select * from `users` where `email` = 'tesztelek@tesztelek.hu' limit 1