Backend/app/Http/Controllers/DishController.php

    public function index()
    {
        //
        return Dish::orderBy('category')->orderBy('name')->paginate(50);
---
select * from `dishes` order by `category` asc, `name` asc limit 50 offset 0
select count(*) as aggregate from `dishes`